Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/MTMA_old/MTMA_old.tmx
Source language: en_us
Languages: de_de

source: c) a scheduler processing the metadata watch-item file-event queue according to a preset time-based schedule provided by the cloud-based RMM platform, the scheduler processing any watch-item file-event data included in the metadata watch-item file-event queue to determine a RW-alert state of the RD module, the scheduler operatively associated with an entropy-analysis-based ransomware detection process to detect potential ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue and generate the RW-alert state which is representative of a positive or negative detection of ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue; and
de_de: c) Verarbeiten der Metadaten-Wächterelement-Dateiereignis-Warteschlange gemäß einem von der cloudbasierten RMM-Plattform bereitgestellten, voreingestellten, zeitbasierten Zeitplan durch einen Scheduler, wobei der Scheduler beliebige in der Metadaten-Wächterelement-Dateiereignis-Warteschlange enthaltene Wächterelement-Dateiereignisdaten verarbeitet, um einen RW-Warnungszustand des RD-Moduls zu bestimmen, wobei der Scheduler operativ mit einem auf Entropieanalyse basierenden Ransomware-Detektionsvorgang verbunden ist, um eine mögliche Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente zu detektieren und den RW-Warnungszustand zu erzeugen, der für eine positive oder negative Detektion einer Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente repräsentativ ist; und

source: d) d) receiving, at the device, a command from the cloud-based RMM platform in response to the generated RW-alert state and the device running an isolation script that maintains communication of the device with the cloud-based RMM platform and disables all communications of the device with other internal and external network locations.
de_de: d) Empfangen eines Befehls von der cloudbasierten RMM-Plattform an der Vorrichtung als Reaktion auf den erzeugten RW-Warnungszustand und Ausführen eines Isolationsskripts durch die Vorrichtung, das die Kommunikation der Vorrichtung mit der cloudbasierten RMM-Plattform aufrechterhält und jegliche Kommunikation der Vorrichtung mit anderen internen und externen Netzwerkstandorten deaktiviert.

source: 2. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, wherein:
de_de: 2. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, wobei:

source: the plurality of devices include one or more of a PC, Personal Computer, desktop computer, tablet PC, a set-top box, STB, a Personal Digital Assistant,PDA, a cellular telephone, a web appliance, a server, a network router, a switch or bridge, or any machine capable of executing a set of instructions – sequential or otherwise – that specify actions to be taken by that machine;
de_de: die Vielzahl von Vorrichtungen einen oder mehrere von Folgenden beinhaltet: einen Personal-Computer (PC), einen Desktop-Computer, einen Tablet-PC, eine Set-Top-Box (STB), einen Persönlichen Digitalen Assistenten (PDA), ein Mobiltelefon, eine Web-Appliance, einen Server, einen Netzwerk-Router, einen Netzwerk-Switch, eine Netzwerk-Brücke oder eine beliebige Maschine, die in der Lage ist, einen Satz von Anweisungen – sequentiell oder anderweitig – auszuführen, die Aktionen angeben, die von dieser Maschine zu unternehmen sind;

source: the OS is one of Windows, macOS, UNIX, and Linux or;
de_de: das Betriebssystem eines von Windows, macOS, UNIX oder Linux ist oder;

source: the RD module is implemented as a dll, dynamic link library, call function.
de_de: das RD-Modul als DLL(Dynamic-Link-Library)-Aufruffunktion implementiert ist.

source: 3. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, wherein the preset time-based schedule includes the scheduler generating timer events at a time interval of t, and t equals 1-20 seconds.
de_de: 3. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, wobei der voreingestellte zeitbasierte Zeitplan beinhaltet, dass der Scheduler Timer-Ereignisse in einem Zeitintervall von t erzeugt, und t 1–20 Sekunden gleichkommt.

source: 4. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1,
de_de: 4. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist,

source: step a) further comprising receiving from the cloud-based RMM platform ransomware monitor configuration data including an exclusion list of one or more files, drives, and volumes to exclude from monitoring for ransomware detection; and
de_de: Schritt a) ferner umfassend Empfangen von Ransomware-Überwachungskonfigurationsdaten von der cloudbasierten RMM-Plattform, die eine Ausschlussliste mit einer oder mehreren Dateien, Laufwerken und Datenträgern beinhalten, die von einem Überwachen auf Ransomware-Detektion auszuschließen sind; und

source: step b) further comprising the filewatcher handler ignoring each create, delete, update and rename file-event included in the exclusion list.
de_de: Schritt b) ferner umfassend Ignorieren jedes in der Ausschlussliste beinhalteten Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignisses durch den Dateiwächter-Handler.

source: 5. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, step b) further comprising collapsing the raw watch-item file-event data; or
de_de: 5. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, Schritt b) ferner umfassend Zusammenfassen der Wächterelement-Dateiereignisrohdaten; oder

source: step c) further comprising:
de_de: Schritt c) ferner umfassend:

source: the scheduler generating timer events according to the preset time-based schedule; and
de_de: Erzeugen von Timer-Ereignissen gemäß dem voreingestellten zeitbasierten Zeitplan durch den Scheduler; und

source: at each timer event, the scheduler determining if the metadata watch-item file-event queue includes any watch-item file-event data,
de_de: bei jedem Timer-Ereignis Bestimmen, ob die Metadaten-Wächterelement-Dateiereignis-Warteschlange beliebige Wächterelement-Dateiereignisdaten beinhaltet, durch den Scheduler,

source: if the metadata watch-item file-event queue does not include any watch-item file-event data, the scheduler terminates until the next timer event is generated, and
de_de: falls die Metadaten-Wächterelement-Dateiereignis-Warteschlange keine Wächterelement-Dateiereignisdaten beinhaltet, Beenden des Schedulers bis das nächste Timer-Ereignis erzeugt wird und

source: if the metadata watch-item file-event queue includes any watch-item file-event data, the scheduler extracts the watch-item file-event data, clears the metadata watch-item file-event queue, and processes the extracted watch-item file-event data to determine a RD-module state, the RD-module state including one of abort, continue and RW-alert, the abort state indicating a negative detection of ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue, the continue state indicating an inconclusive determination of ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue, and the RW-alert state indicating a detection of ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue.
de_de: falls die Metadaten-Wächterelement-Dateiereignis-Warteschlange beliebige Wächterelement-Dateiereignisdaten beinhaltet, Extrahieren der Wächterelement-Dateiereignisdaten, Leeren der Metadaten-Wächterelement-Dateiereignis-Warteschlange und Verarbeiten der extrahierten Wächterelement-Dateiereignisdaten durch den Scheduler, um einen RD-Modulzustand zu bestimmen, wobei der RD-Modulzustand einen von Abbruchzustand, Fortsetzungszustand oder RW-Warnungszustand beinhaltet, wobei der Abbruchzustand eine negative Detektion einer Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente anzeigt, der Fortsetzungszustand eine nicht schlüssige Bestimmung einer Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente anzeigt und der RW-Warnungszustand eine Detektion einer Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente anzeigt.

source: 6. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, wherein an abort state determination clears the RD-module state, a continue state carries over a previously determined RD-module state and the RW-alert state generates a notification to the cloud-based RMM platform, the notification including information about one or more suspected ransomware-encryption files.
de_de: 6. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, wobei eine Abbruchzustandsbestimmung den RD-Modulzustand leert, ein Fortsetzungszustand einen zuvor bestimmten RD-Modulzustand überträgt und der RW-Warnungszustand eine Benachrichtigung an die cloudbasierte RMM-Plattform erzeugt, wobei die Benachrichtigung Informationen über eine oder mehrere verdächtige Ransomware-Verschlüsselungsdateien beinhaltet.

source: 7. The RMM system operatively associated with monitoring and managing a plurality of devices according to claim 1, step c) further comprising:
de_de: 7. RMM-System nach Anspruch 1, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen verbunden ist, Schritt c) ferner umfassend:

source: if the metadata watch-item file-event queue includes any watch-item file-event data, the scheduler extracts the watch-item file-event data and performs one or more of the following:
de_de: falls die Metadaten-Wächterelement-Dateiereignis-Warteschlange beliebige Wächterelement-Dateiereignisdaten beinhaltet, Extrahieren der Wächterelement-Dateiereignisdaten und Durchführen eines oder mehrerer der folgenden Schritte durch den Scheduler:

source: collapsing file-events associated with the watch-item file-event data into one or more other create, delete, update, and rename file file-events;
de_de: Zusammenfassen von mit den Wächterelement-Dateiereignisdaten verbundenen Dateiereignissen zu einem oder mehreren anderen Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignis;

source: analyzing the watch-item file-event data to determine if the associated file events are consistent with one or more predetermined file update patterns representative of a potential ransomware-encryption; and
de_de: Analysieren der Wächterelement-Dateiereignisdaten, um zu bestimmen, ob die verbundenen Dateiereignisse mit einem oder mehreren vorbestimmten Dateiaktualisierungsmustern übereinstimmen, die für eine mögliche Ransomware-Verschlüsselung repräsentativ sind; und

source: analyzing the watch-item file-event data to determine if the associated file events include one or more of an encryption of a minimum number of files, an encryption of a minimum percentage of files, a low frequency encryption of the files, and a high frequency encryption of the files.
de_de: Analysieren der Wächterelement-Dateiereignisdaten, um zu bestimmen, ob die verbundenen Dateiereignisse eines oder mehrere von Folgenden beinhalten: eine Verschlüsselung einer Mindestanzahl von Dateien, eine Verschlüsselung eines Mindestprozentsatzes von Dateien, eine niedrigfrequente Verschlüsselung der Dateien und eine hochfrequente Verschlüsselung der Dateien.

source: 8. A Ransomware Detection, RD, and Isolation module operatively associated with a cloud-based RMM, Remote Monitoring and Management, platform hosted by a cloud-based infrastructure service and configured to monitor and manage a plurality of devices, the RD and Isolation module comprising:
de_de: 8. Ransomware-Detektions(RD)- und Isolierungsmodul, das operativ mit einer von einem cloudbasierten Infrastrukturdienst gehosteten cloudbasierten RMM(Remote Monitoring and Management)-Plattform verbunden ist und konfiguriert ist, eine Vielzahl von Vorrichtungen zu überwachen und zu verwalten, das RD- und Isolierungsmodul umfassend:

source: a dynamic link library file and API, Application Programming Interface, configured to perform a method of detecting a ransomware-encryption in a plurality of files received by the device, the method including:
de_de: eine Dynamic-Link-Library-Datei und eine API (Application Programming Interface), die konfiguriert sind, ein Verfahren eines Detektierens einer Ransomware-Verschlüsselung in einer Vielzahl von von der Vorrichtung empfangenen Dateien durchzuführen, wobei das Verfahren Folgendes beinhaltet:

source: a) the RD module receiving from the cloud-based RMM platform ransomware monitor configuration data, the ransomware monitor configuration data including one or more watch-items including a list of one or more files, drives, and volumes to monitor for ransomware detection;
de_de: a) Empfangen von Ransomware-Überwachungskonfigurationsdaten von der cloudbasierten RMM-Plattform durch das RD-Modul, wobei die Ransomware-Überwachungskonfigurationsdaten ein oder mehrere Wächterelemente beinhalten, die eine Liste einer oder mehrerer Dateien, Laufwerke und Datenträger beinhalten, um auf Ransomware-Detektion zu überwachen;

source: b) the RD module initiating a filewatcher and filewatcher handler to monitor and receive callbacks for create, delete, update, and rename file-events associated with the watch-items, the filewatcher adding each create, delete, update and rename file-event to a metadata watch-item file-event queue, the metadata watch-item file-event queue including raw watch-item file-event data associated with each create, delete, update, and rename file-event associated with the watch-items received from the cloud-based RMM platform, the raw-data including one or more of fileobjects and parent folders identified in the watch-item file-event;
de_de: b) Initiieren eines Dateiwächters und eines Dateiwächter-Handlers durch das RD-Modul, um Rückrufe für mit den Wächterelementen verbundene Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignisse zu überwachen und zu empfangen, wobei der Dateiwächter jedes Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignis einer Metadaten-Wächterelement-Dateiereignis-Warteschlange hinzufügt, wobei die Metadaten-Wächterelement-Dateiereignis-Warteschlange Wächterelement-Dateiereignisrohdaten beinhaltet, die mit jedem mit den von der cloudbasierten RMM-Plattform empfangenen Wächterelementen verbundenen Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignis verbunden sind, wobei die Rohdaten eines oder mehrere von Dateiobjekten und übergeordneten Ordnern beinhalten, die in dem Wächterelement-Dateiereignis identifiziert sind;

source: c) a RD module scheduler processing the metadata watch-item file-event queue according to a preset time-based schedule provided by the cloud-based RMM platform, the scheduler processing any watch-item file-event data included in the metadata watch-item file-event queue to determine a RW-alert state of the RD module, the scheduler operatively associated with an entropy-analysis-based ransomware detection process to detect potential ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue and generate the RW-alert state which is representative of a positive or negative detection of ransomware-encryption of one or more of the watch-items listed in the watch-item file-event queue;
de_de: c) Verarbeiten der Metadaten-Wächterelement-Dateiereignis-Warteschlange gemäß einem von der cloudbasierten RMM-Plattform bereitgestellten, voreingestellten, zeitbasierten Zeitplan durch einen RD-Modul-Scheduler, wobei der Scheduler beliebige in der Metadaten-Wächterelement-Dateiereignis-Warteschlange beinhaltete Wächterelement-Dateiereignisdaten verarbeitet, um einen RW-Warnungszustand des RD-Moduls zu bestimmen, wobei der Scheduler operativ mit einem auf Entropieanalyse basierenden Ransomware-Detektionsvorgang verbunden ist, um eine mögliche Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente zu detektieren und den RW-Warnungszustand zu erzeugen, der für eine positive oder negative Detektion einer Ransomware-Verschlüsselung eines oder mehrerer der in der Wächterelement-Dateiereignis-Warteschlange aufgelisteten Wächterelemente repräsentativ ist;

source: d) in response to a positive RW-alert state detected on a ransomware affected device, the cloud-based RMM platform transmitting isolation script to the ransomware affected device; and
de_de: d) als Reaktion auf einen positiven auf einer von Ransomware betroffenen Vorrichtung detektierten RW-Warnungszustand, Übermitteln eines Isolationsskripts an die von Ransomware betroffene Vorrichtung durch die cloudbasierte RMM-Plattform; und

source: e) the ransomware affected device running the isolation script, the isolation script maintaining the device communication with the cloud-based RMM platform and disabling the ransomware affected device communication to all other internal and external network locations, the isolation script including:
de_de: e) Ausführen des Isolationsskripts durch die von Ransomware betroffene Vorrichtung, wobei das Isolationsskript die Kommunikation der Vorrichtung mit der cloudbasierten RMM-Plattform aufrechterhält und die Kommunikation der von Ransomware betroffenen Vorrichtung zu allen anderen internen und externen Netzwerkstandorten deaktiviert, wobei das Isolationsskript Folgendes beinhaltet:

source: e1) changing the ransomware affected device network information pertinent to the ransomware affected device network connection to the cloud-based RMM platform from a temporary DHCP, Dynamic Host Configuration Protocol, IP address assignment to a static IP address assignment, the network information including one or more of an internal IP, Internet Protocol, address of one or more active network adapters, inactive network adapters, a subnet mask of the one or more network adapters, a default gateway assignment of the one or more network adapters;
de_de: e1) Ändern der Netzwerkinformationen der von Ransomware betroffenen Vorrichtung, die für die Netzwerkverbindung der von Ransomware betroffenen Vorrichtung zu der cloudbasierten RMM-Plattform relevant sind, von einer temporären DHCP(Dynamic Host Configuration Protocol)-IP-Adresszuweisung zu einer statischen IP-Adresszuweisung, wobei die Netzwerkinformationen eines oder mehrere von Folgenden beinhalten: eine interne IP(Internet Protocol)-Adresse, eine Adresse eines oder mehrerer aktiver Netzwerkadapter, inaktive Netzwerkadapter, eine Subnetzmaske des einen oder der mehreren Netzwerkadapter, eine Standard-Gateway-Zuweisung des einen oder der mehreren Netzwerkadapter;

source: e2) nullifying local network and external network information on the ransomware affected device rendering the ransomware affected device unable to access any internal and external network, the nullified local and external network information including one or more of DNS, Domain Name System, server assignments for associated network adapters, default gateways of the associated network adapters, routing table of the ransomware affected device, routing information base of the ransomware affected device, ARP, Address Resolution Protocol, cache and NetBIOS cache; and
de_de: e2) Ungültigmachen von lokalen Netzwerkinformationen und externen Netzwerkinformationen auf der von Ransomware betroffenen Vorrichtung, wodurch die von Ransomware betroffene Vorrichtung nicht mehr auf ein internes oder externes Netzwerk zugreifen kann, wobei die ungültig gemachten lokalen und externen Netzwerkinformationen eines oder mehrere von Folgenden beinhalten: DNS(Domain Name System)- Serverzuweisungen für verbundene Netzwerkadapter, Standard-Gateways der verbundenen Netzwerkadapter, Routingtabelle der von Ransomware betroffenen Vorrichtung, Routing-Informationsbasis der von Ransomware betroffenen Vorrichtung, ARP(Address Resolution Protocol)-Cache und NetBIOS-Cache; und

source: e3) re-adding to the ransomware affected device routing table the pertinent network information changed to an unchanging DHCP configuration in step e1) directly linking the default gateway IP stored in step e1) to reestablish a network connection from the ransomware affected device to the cloud-based RMM platform, the re-added network information including one or more of IP addresses for a partner RMM geographical platform, DNS servers, and the ransomware affected devices' HOSTS file; and
de_de: e3) erneutes Hinzufügen der in Schritt e1) auf eine unveränderliche DHCP-Konfiguration geänderten relevanten Netzwerkinformationen zu der Routing-Tabelle der von Ransomware betroffenen Vorrichtung, wobei die in Schritt e1) gespeicherte IP-Adresse des Standard-Gateways direkt verknüpft wird, um eine Netzwerkverbindung von der von Ransomware betroffenen Vorrichtung zu der cloudbasierten RMM-Plattform wiederherzustellen, wobei die erneut hinzugefügten Netzwerkinformationen eine oder mehrere von IP-Adressen für eine geografische Partner-RMM-Plattform, DNS-Server und die HOSTS-Datei der von Ransomware betroffenen Vorrichtung beinhalten; und

source: f) the ransomware affected device communicating to the cloud-based RMM platform over the RMM platform network connection isolation status information of the ransomware affected device.
de_de: f) Kommunizieren von Isolierungsstatusinformationen der von Ransomware betroffenen Vorrichtung an die cloudbasierte RMM-Plattform über die Netzwerkverbindung der RMM-Plattform durch die von Ransomware betroffene Vorrichtung.

source: 9. The Ransomware Detection and Isolation module operatively associated with a cloud-based RMM platform according to claim 8, wherein the method further comprises:
de_de: 9. Ransomware-Detektions- und Isolierungsmodul nach Anspruch 8, das operativ mit einer cloudbasierten RMM-Plattform verbunden ist, wobei das Verfahren ferner Folgendes umfasst:

source: step e) adding each IP address from the routing list to a device local routing table with a link directly to an IP address of the device default gateway setting with a subnet mask of a fixed value, thereby ensuring a direct link between the cloud-based RMM platform servers and the gateway while removing the default gateway assignment which nullifies all connectivity between the device and any other network internal and external services.
de_de: Schritt e) Hinzufügen jeder IP-Adresse aus der Routing-Liste zu einer lokalen Routing-Tabelle der Vorrichtung mit einer direkten Verknüpfung zu einer IP-Adresse der Standard-Gateway-Einstellung der Vorrichtung mit einer Subnetzmaske mit fixem Wert, wodurch eine direkte Verknüpfung zwischen den cloudbasierten RMM-Plattform-Servern und dem Gateway sichergestellt ist, während die Standard-Gateway-Zuweisung entfernt wird, was jegliche Konnektivität zwischen der Vorrichtung und beliebigen anderen internen und externen Netzwerkdiensten ungültig macht.
